export default function About() {
  return (
    <div className="max-w-4xl mx-auto p-6 md:p-12 mb-20 bg-card shadow-sm border mt-10 rounded-3xl">
      <h1 className="text-3xl md:text-5xl font-bold mb-8 text-primary tracking-tight">आपले विवाहवेध मॅट्रीमोनी मध्ये स्वागत आहे!</h1>
      
      <div className="space-y-6 text-lg text-muted-foreground leading-relaxed font-medium">
        <p>
          लग्न का करावे? कोणाशी करावे? Love Marriage की Arrange Marriage असे उत्तर नसलेले प्रश्न आजच्या विवाहेच्छुक मुला-मुलींना पडलेले आहेत. जन्मापासून ते वयाच्या पंचविसाव्या वर्षांपर्यंत स्वच्छंदीपणे जगत आलेल्या आयुष्यात अचानक एक मोठा व महत्त्वाचा निर्णय आपण घेणार असतो... आपल्या Priorities आणि Future of Life प्लॅन करताना लग्न हा मुद्दा फार महत्त्वाचा ठरतो. अशी एक व्यक्ती की त्या व्यक्तीसोबत आपण आपल्या आयुष्याचा संपूर्ण प्रवास निश्चित करणार असतो. अशावेळी प्रत्येकाला आपण घेतलेला निर्णय बरोबर की चूक हे कळत नसते. यापेक्षा अजून चांगले... आजून चांगले व एक नंबरच्या शोधात व संभ्रमात राहून आपण लग्नाला किती वेळ करत आहोत याचे भान आजच्या पिढीला राहिलेले नाही.
        </p>

        <p>
          शिवाय आपली एकत्र कुटुंब व्यवस्था कमी होत असलेले मामा, काका, मावशी, आत्या, आजोबा ही आपली वडीलधारी मंडळी लग्न जमविणेच प्रयत्न करताना दिसत नाहीत. किंबहुना त्यांचे प्रयत्न कमी पडत आहेत. पालकांचा कितीही मोठा जनसंपर्क असो, आर्थिक परिस्थिती कितीही उत्तम असो तरीही त्यांना मुला-मुलींची लग्न जमविताना अडचणी या येत आहेतच. अशा वेळी आपण निश्चतच Online नोंदणीचा पर्याय निवडतो. वेबसाईट वरून पत्ते, फोन नंबर खूप मिळतात पण त्यातून लग्न किती जमतात हा एक संशोधनाचाच भाग आहे. अनेक विवाह संस्थांनी आपल्या भावनांचा गैरफायदा घेत आपल्या गरजेला बाजारूपणाचे रूप दिले आहे. माफ करा आम्ही कोणावरही आरोप करत नाही पण हे वास्तव सत्य आहे जे आम्हाला बऱ्याच पालकांच्या चर्चेतून जाणवले आहे.
        </p>

        <p>
          अशावेळी आपल्याला एक योग्य पर्याय उपलब्ध करून द्यावा ह्या एक प्रामाणिक हेतूने गेली पाच वर्षे पूर्ण अभ्यासपूर्वक विचार करून आम्ही विवाहवेध मॅट्रीमोनी ही आपली वाटणारी अशी आपल्याच भागातील व आपल्याला हवीशी वाटणारी अशी स्थळे असलेली वेबसाईट सुरु करीत आहोत. आपल्या मुला-मुलींना समुपदेशन करणे, आईवडील, मुले-मुली यांना वैक्तिकरित्या भेटून त्यांच्या विचारातील जनरेशन गॅप ची विसंगती दूर करणे व त्यांचे लग्न लवकरात लवकर होण्यासाठी प्रामाणिक प्रयत्न व वधू-वर संशोधन ते लग्न हा प्रवास सुखकर होण्यासाठी आपण नक्कीच आपल्या कार्यालयाला भेट द्या... हा प्रयत्न आम्ही अगदी मनापासून व आवडीने करत आहोत. आणि खात्रीपूर्वक सांगू इच्छितो कि, आपला वेळ वाया गेला असे वाटणार नाही. योग्य जोडीदार निवडीचे पहिले पाऊल...
        </p>
      </div>

      <div className="mt-12 text-center">
        <p className="text-xl font-bold bg-gradient-to-r from-primary to-rose-500 bg-clip-text text-transparent">
          म्हणजेच आपले<br/>विवाहवेध मॅट्रीमोनी......
        </p>
      </div>
    </div>
  );
}
